tuminh21/device_nrf52840/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_uart - Copy/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    nrf_pwr_mgmt_run();
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}

#define SOLUTION 0
#define TEST_OPTION 0
#define PDM_BUFFER_BLOCK_LENGTH (100)
#define BUFFER_FULL (1u)
#define BUFFER_PENDING (0u)

nrfx_pdm_config_t pdm_for_test = NRFX_PDM_DEFAULT_CONFIG(27,26);

uint16_t pdm_buffer[PDM_BUFFER_BLOCK_LENGTH];
uint8_t writeIndexOld = 0;

uint8_t writeData2QueueStatus = 0;
uint32_t timeStart;
uint32_t timeEnd;
uint32_t deltaTime = 0;
uint32_t timeStart1;
uint32_t timeEnd1;
uint32_t deltaTime1 = 0;
int count=0;

void pdm_buffer_handler(nrfx_pdm_evt_t const *p_evt)
{
    if(p_evt->error == NRFX_PDM_ERROR_OVERFLOW)
    {
        return;
    }
    else
    {
        if(p_evt->buffer_requested == true)
        {
            // memcpy data from buffer to queue
            #if(SOLUTION == 0)
            if(writeData2QueueStatus == QUEUE_OK)
            {
                if(writeIndex != 0)  writeIndexOld = writeIndex - 1;
                else writeIndexOld = QUEUE_NUMBER - 1;              
                queue[writeIndexOld].status = QUEUE_FULL;
            }
            if(QUEUE_EMPTY == queue[writeIndex].status)
            {    
                writeData2QueueStatus = QUEUE_OK;
                nrfx_pdm_buffer_set(&queue[writeIndex].buffer[0],PDM_BUFFER_BLOCK_LENGTH);
                writeIndex ++; 
                if(writeIndex >= QUEUE_NUMBER) writeIndex = 0;              
                //(void)writeData2Queue(&pdm_buffer1[0],PDM_BUFFER_BLOCK_LENGTH);
            }
            else
            {
                writeData2QueueStatus = QUEUE_ERROR;
                nrfx_pdm_buffer_set(&pdm_buffer[0],PDM_BUFFER_BLOCK_LENGTH);
            }
            
            #elif(SOLUTION == 1)
                (void)writeData2Queue(&pdm_buffer[0],PDM_BUFFER_BLOCK_LENGTH);
                nrfx_pdm_buffer_set(&pdm_buffer[0],PDM_BUFFER_BLOCK_LENGTH);
            #endif
            

        }
    }
}


/**@brief Application main function.
 */
uint16_t Pdm_bufferQueue[PDM_BUFFER_BLOCK_LENGTH];
uint8_t ble_buffer[2*PDM_BUFFER_BLOCK_LENGTH];


int main(void)
{
    bool erase_bonds;
    /******** PDM init ************/
    nrfx_err_t result = nrfx_pdm_init(&pdm_for_test, pdm_buffer_handler);	
    (void)nrfx_pdm_stop();
    queueInit();
    /********** log init **********/
    log_init();
    nrf_delay_ms(100);
    /********** Timer init **********/
    timers_init();
    /********** doan nay tu sua nhe *********/
    power_management_init();
    nrf_delay_ms(100);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    nrf_delay_ms(100);

    advertising_start();
    /************** led init ****************/
    nrf_gpio_cfg_output(LED);
    nrf_gpio_pin_write(LED, 1);

    NRF_LOG_INFO("Hello \n");
    deltaTime = 0;
    // print result
    for (;;)
    {      

        for (int i=0;i<10;i++){
          nrf_delay_ms(1000);
          NRF_LOG_INFO("%d \n", i);
        
        }

        //timeStart = app_timer_cnt_get();
        idle_state_handle();     
        bleCheckStatus2enablePdm();       
        pdm_handle_data();  
        if (count == 100){
          NRF_LOG_INFO("Done");
        }




        //if(writeData2QueueStatus == QUEUE_ERROR)
        //{
        //#if(TEST_OPTION == 1)
        //    NRF_LOG_INFO("0");
        //#endif
        
        //}
        //timeEnd = app_timer_cnt_get();
        //deltaTime = timeEnd - timeStart;
        ////NRF_LOG_INFO("%u",deltaTime);
        //if(deltaTime >= 213) // 6.5ms
        //{
        //    nrf_gpio_pin_write(LED, 1); // bad - sang
        //}
        //else
        //{
        //    nrf_gpio_pin_write(LED, 1); // good - tat
        //}

        
        #if(TEST_OPTION == 1)
        Test();
        #endif
       
    }
}

/************** ***************/
void pdm_handle_data()
{
    uint32_t err_code;
    uint16_t l_len;
    if(ble_status != BLE_CONNECTED) return;
    #if(SOLUTION == 0)
    if(QUEUE_FULL == queue[readIndex].status)
    {
        //memcpy(l_data,queue[readIndex].buffer,sizeof(queue  [readIndex].buffer));
        l_len = PDM_BUFFER_BLOCK_LENGTH*2;
        convertPDM2Ble(ble_buffer,&queue[readIndex].buffer[0],PDM_BUFFER_BLOCK_LENGTH);
        queue[readIndex].status = QUEUE_EMPTY;
        err_code = ble_nus_data_send(&m_nus, ble_buffer, &l_len, m_conn_handle);
        readIndex ++;
        if(readIndex >= QUEUE_NUMBER){
         readIndex = 0;				
        }  
        /************************/
        if(count % 160 == 0){
          NRF_LOG_INFO(" %d", count);
        }
        count++;

    }
    #elif(SOLUTION == 1)
        (void)readDataFromQueue(Pdm_bufferQueue,PDM_BUFFER_BLOCK_LENGTH);
        convertPDM2Ble(ble_buffer,Pdm_bufferQueue,PDM_BUFFER_BLOCK_LENGTH);
        err_code = ble_nus_data_send(&m_nus, ble_buffer, &l_len, m_conn_handle);

    #endif
}

/*********** convert from PDM buffer to BLE buffer *************/
void convertPDM2Ble(uint8_t *l_dataBle, uint16_t *l_dataPdm, uint8_t l_len)
{
    uint8_t l_index;
    for(l_index=0;l_index<l_len;l_index++)
    {
        l_dataBle[l_index*2] = (uint8_t)(l_dataPdm[l_index]>>8);
        l_dataBle[l_index*2 + 1] = (uint8_t)(l_dataPdm[l_index]);
    }
}

/************ check ble status **********/
uint8_t bleCheckStatus2enablePdm()
{
    static uint8_t ble_statusOld = BLE_DISCONNECTED;
    if(ble_status != ble_statusOld)
    {
        ble_statusOld = ble_status;
        if(ble_status == (uint8_t)BLE_DISCONNECTED)
        {
            (void)nrfx_pdm_stop();
        }
        else if(ble_status == (uint8_t)BLE_CONNECTED)
        {
            (void)nrfx_pdm_start();
        }
        else
        {
            (void)nrfx_pdm_stop();
            // do nothing
        }
    }

}

/**************** test loop working ************/
void Test()
{
    static uint32_t timeTickCount = 0;
    static uint8_t ledValue;
    timeTickCount ++;
    if(timeTickCount%500 == 0) // ~ 1s
    {
        //timeTickCount = 0;
        //NRF_LOG_INFO("1");
        //NRF_LOG_INFO("%u",deltaTimeLoop);
        ledValue = (1<<ledValue)&0x01;
        nrf_gpio_pin_write(LED, ledValue);
    }

}

/**
 * @}
 */